app/controllers/annuaire_controller.rb

SELECT "annuaires".* FROM "annuaires" INNER JOIN "users" ON "users"."id" = "annuaires"."user_id" WHERE "users"."username" = $1  [["username", "Andry"]]
SELECT "users".* FROM "users" INNER JOIN "annuaires" ON "annuaires"."user_id" = "users"."id" WHERE "annuaires"."user_id" IS NULL
SELECT "annuaires".* FROM "annuaires" ORDER BY id DESC
---
  def index
    if params[:term] # Si le paramètre  term existe, c-à-d quand l'utilisateur un nom dans le formulaire de recherche
      @annuaires = Annuaire.joins(:user).where("lower(#{:username}) LIKE '%#{params[:term].downcase}%'").all
    else
      @annuaires = Annuaire.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "annuaires" ("num_dept", "nom_dpt", "commune", "email", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @annuaire_user = User.find(current_user.id)
    @annuaire = Annuaire.new(annuaire_params)
    @annuaire.user = @annuaire_user
      if @annuaire.save

SELECT  "annuaires".* FROM "annuaires" WHERE "annuaires"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_id
    @annuaire = Annuaire.find(params[:id])