app/views/annuaire/index.html.erb

				<td><%= element.email %></td>
				<td><%= User.find(element.user_id).username %></td> <!-- A remplacer par le créateur du post -->
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]